In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = sns.load_dataset('titanic')

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
q1 = df['age'].quantile(0.25)
q3 = df['age'].quantile(0.75)
iqr = q3 - q1
lower_bound = q1 - iqr*1.5
upper_bound = q3 + iqr*1.5

outliers_age = df[(df['age'] < lower_bound) | (df['age'] > upper_bound)]
print(outliers_age)

     survived  pclass   sex   age  sibsp  parch     fare embarked   class  \
33          0       2  male  66.0      0      0  10.5000        S  Second
54          0       1  male  65.0      0      1  61.9792        C   First
96          0       1  male  71.0      0      0  34.6542        C   First
116         0       3  male  70.5      0      0   7.7500        Q   Third
280         0       3  male  65.0      0      0   7.7500        Q   Third
456         0       1  male  65.0      0      0  26.5500        S   First
493         0       1  male  71.0      0      0  49.5042        C   First
630         1       1  male  80.0      0      0  30.0000        S   First
672         0       2  male  70.0      0      0  10.5000        S  Second
745         0       1  male  70.0      1      1  71.0000        S   First
851         0       3  male  74.0      0      0   7.7750        S   Third

     who  adult_male deck  embark_town alive  alone
33   man        True  NaN  Southampton    no   True
54   man        True    B    Cherbourg    no  False
96   man        True    A    Cherbourg    no   True
116  man        True  NaN   Queenstown    no   True
280  man        True  NaN   Queenstown    no   True
456  man        True    E  Southampton    no   True
493  man        True  NaN    Cherbourg    no   True
630  man        True    A  Southampton   yes   True
672  man        True  NaN  Southampton    no   True
745  man        True    B  Southampton    no  False
851  man        True  NaN  Southampton    no   True

In [6]:
q1 = df['fare'].quantile(0.25)
q3 = df['fare'].quantile(0.75)
iqr = q3 - q1
lower_bound = q1 - iqr*1.5
upper_bound = q3 + iqr*1.5

outliers_age = df[(df['fare'] < lower_bound) | (df['fare'] > upper_bound)]
print(outliers_age)

     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
1           1       1  female  38.0      1      0   71.2833        C  First
27          0       1    male  19.0      3      2  263.0000        S  First
31          1       1  female   NaN      1      0  146.5208        C  First
34          0       1    male  28.0      1      0   82.1708        C  First
52          1       1  female  49.0      1      0   76.7292        C  First
..        ...     ...     ...   ...    ...    ...       ...      ...    ...
846         0       3    male   NaN      8      2   69.5500        S  Third
849         1       1  female   NaN      1      0   89.1042        C  First
856         1       1  female  45.0      1      1  164.8667        S  First
863         0       3  female   NaN      8      2   69.5500        S  Third
879         1       1  female  56.0      0      1   83.1583        C  First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
27     man        True    C  Southampton    no  False
31   woman       False    B    Cherbourg   yes  False
34     man        True  NaN    Cherbourg    no  False
52   woman       False    D    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
846    man        True  NaN  Southampton    no  False
849  woman       False    C    Cherbourg   yes  False
856  woman       False  NaN  Southampton   yes  False
863  woman       False  NaN  Southampton    no  False
879  woman       False    C    Cherbourg   yes  False

[116 rows x 15 columns]

In [7]:
outliers_age.value_counts().sum()

85

In [8]:
df.shape

(891, 15)

In [9]:
df = df[(df['age'] >= lower_bound) & (df['age'] <= upper_bound)]
df = df[(df['fare'] >= lower_bound) & (df['fare'] <= upper_bound)]

In [10]:
df.shape

(606, 15)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 606 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     606 non-null    int64
 1   pclass       606 non-null    int64
 2   sex          606 non-null    object
 3   age          606 non-null    float64
 4   sibsp        606 non-null    int64
 5   parch        606 non-null    int64
 6   fare         606 non-null    float64
 7   embarked     606 non-null    object
 8   class        606 non-null    category
 9   who          606 non-null    object
 10  adult_male   606 non-null    bool
 11  deck         95 non-null     category
 12  embark_town  606 non-null    object
 13  alive        606 non-null    object
 14  alone        606 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 59.7+ KB

In [12]:
df.nunique()

survived         2
pclass           3
sex              2
age             81
sibsp            6
parch            7
fare           176
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [13]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [14]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True

In [15]:
df.nunique()

survived         2
pclass           3
sex              2
age             81
sibsp            6
parch            7
fare           176
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [16]:
df.duplicated().sum()

35

In [17]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [18]:
df.columns.values

array(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'], dtype=object)

In [21]:
df.duplicated().any()

True